Revit 2027 API
Element.GetExternalResourceReferences Method
 Gets the map of the external resource references referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ExternalResourceType, ExternalResourceReference> GetExternalResourceReferences()
Public Function GetExternalResourceReferences As IDictionary(Of ExternalResourceType, ExternalResourceReference)
public:
IDictionary<ExternalResourceType^, ExternalResourceReference^>^ GetExternalResourceReferences()
member GetExternalResourceReferences : unit -> IDictionary<ExternalResourceType, ExternalResourceReference>
Return Value
IDictionary<ExternalResourceType, ExternalResourceReference>
 The map of the external resource references referenced by the element.
Exceptions
Exception | Condition
InvalidOperationException |  This Element does not use any external resource.
Remarks
 For an element which has multiple external resource references under a specified type like AppearanceAssetElement, the first one will be the value in the map. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferencesExpanded].
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace